"""
โครงสร้างควบคุม (Control Structure)
1.แบบลำดับ
2.แบบเลือก
3.แบบทำซ้ำ
"""

#โครงสร้างควบคุมแบบเลือก

"""
if boolean expression: => หากเงื่อนไขเป็นจริง statement จะทำงานต่อ
    statement
"""
age=int(input("ป้อนอายุของคุณ : "))
name="dotcom 29"

print(type(age==15))
print(name=="dotcom 29")

if age>=15 : #หากเงื่อนไขเป็นจริง โปรแกรมจะทำงานบรรทัดที่ 21,22
        print("คำนำหน้าเป็น นาย/นางสาว")
        print("จบโปรแกรมด้านใน if")
print("จบโปรแกรม")

"""
if จริง :
    ทำอะไร
else :
    ทำอะไร
"""

if age>=15 : #หากเงื่อนไขเป็นจริง โปรแกรมจะทำงานบรรทัดที่ 22,23
        print("คำนำหน้าเป็น นาย/นางสาว")
        print("จบโปรแกรมด้านใน if")
else :
    print("จบโปรแกรม")

#ข้อควรระวังในการใช้ if => มันจะเช็คทุกเคส และเอาทุกเคส
if age>=15:
     print("วัยรุ่น")
if age>=20:
     print("วัยผู้ใหญ่")
if age>=30:
     print("วัยทำงาน")
else:
     print("วัยเด็ก")
print("จบโปรแกรม")

#หากเราเพิ่ม elif => มันจะทำงานแค่เคสเดียวแล้วจบการทำงานเลย
if age>=15:
     print("วัยรุ่น")
elif age>=20:
     print("วัยผู้ใหญ่") 
elif age>=30:
     print("วัยทำงาน")
else:
     print("วัยเด็ก") 
print("จบโปรแกรม")

#หากเรากำหนดค่าระหว่าง ใช้ and, or, not
#การใช้ and
age=int(input("ป้อนอายุของคุณ :"))
if age>=15 and age <=20: #ต้องเป็นจริงทั้งสองฝั่งวัยรุ่นถึงจะทำงาน
    print("วัยรุ่น")
elif age>=20 and age<=29:
    print("วัยหนุ่มสาว")
elif age>=30 and age<=39:
    print("วัยผู้ใหญ่")
elif age>=80:
    print("วัยชรา")
else :
    print("วัยเด็ก")
print("จบโปรแกรม")

#การใช้ or
#ให้ age = 14
age=int(input("ป้อนอายุของคุณ :"))
if age>=15 or age<=20: #หากฝั่งใดฝั่งหนึ่งเป็นจริง จะปริ้นวัยรุ่น
     print("วัยรุ่น")

#การใช้ not
#ให้ age = 14,-10
age=int(input("ป้อนอายุของคุณ :"))
if not age>=15: #หากใส่ค่าอะไรที่เป็นตรงข้าม
     print("วัยรุ่น")