# แสดงผลตัวเลขเป็นขั้นบันได

"""
input = 6

1
12
123
1234
12345
123456

"""

last=int(input("ป้อนตัวเลข = ")) # เราอยากได้เลขอะไรเป็นตัวสุดท้าย

for row in range(1,last+1): # row => แนวตั้ง , column => แนวนอน
    for column in range(1,row+1): 
        print(column,end='') #การระบุ end คือการแสดงผลในแนวนอน
    print(" ") #การขึ้นบรรทัดใหม่


""" อธิบายวิธีการทำงานของโปรแกรม
input = 3 #หากเราป้อนข้อมูลเท่ากับ 3

row = 1 , 3 #โปรแกรมจะทำงานตั้งแต่ 1 ถึง 2 ครั้ง , หาก last+1 ก็จะเป็นถึง 3 ครั้ง
column 1,1+1=2
แสดงผลที่หน้าจอ = 1

row 2
column 1,2+1=3
แสดงผลที่หน้าจอ = 12

row 3
column 1,3+1=4
แสดงผลที่หน้าจอ = 123

"""