# การสร้างตารางหมากฮอต

"""
xxx
xxx
xxx

x = สีน้ำตาล
o = สีขาว
"""
'''โดยตารางแถวแรกสีน้ำตาลจะอยู่ในตำแหน่งแลขคู่ และแถวที่สองจะอยู่ในตำแหน่งเลขคี่
และสีขาวแถวแรกจะอยู่ในตำแหน่งเลขคี่ และแถวที่สองจะอยู่ในตำแหน่งเลขคู่ สลับกันไปมา
'''

number=int(input("ป้อนขนาด  = "))
for row in range(number) :
    for column in range(number):
        print("x",end="") if (row+column)%2 == 0 else print("o",end="")
    print(" ")

# 3 x 3
#(แถวที่หนึ่ง)
# row = 0 +  column = 0  => 0+0=0 , หาร 2 ลงตัวจะปริ้น x
# row = 0 +  1  => 0+1=1 , หาร 2 ไม่ลงตัว print o
# row = 0 +  2 => 0+2=2 , หาร 2 ลงตัว print x
"""
xox => ผลลัพธ์ของแถวแรก

"""

#(แถวที่สอง)
# row = 1 +  column = 0 => 1+0=1 , หาร 2 ไมาลงตัว print o
# row = 1 +  1  => 1+1=2 , หาร 2 ลงตัว print x
# row = 1 +  2 => 1+2=3 , หาร 2 ไม่ลงตัว print o
"""
oxo => ผลลัพธ์ของแถวที่สอง

"""

#(แถวที่สาม)
# row = 2 +  column = 0 => 2+0=2 , หาร 2 ลงตัว print x
# row = 2 +  1  => 2+1=3 , หาร 2 ไม่ลงตัว print o
# row = 2 +  2  => 2+2=4 , หาร 2 ลงตัว print x
"""
xox => ผลลัพธ์ของแถวที่สาม

"""


"""
xox => ผลลัพธ์ของแถวแรก
oxo => ผลลัพธ์ของแถวที่สอง
xox => ผลลัพธ์ของแถวสาม
"""