# ยกข้อมูลอย่างน้อยสองค่า มาเปรียบเทียบกัน
# ชนิดข้อมูลต้องเป็นชนิดเดียวกัน
# คำตอบ 2 คำตอบ => จริง / เท็จ

x,y = 10,5
print("ค่า x มากกว่า y หรือไม่ : " ,x>y)
print("ค่า x น้อยกว่า y หรือไม่ : " ,x<y)
print("ค่า x เท่ากับ y หรือไม่ : " ,x==y)
print("ค่า x ไม่เท่ากับ y หรือไม่ : ",x!=y)

#หรือ
a,b = 6,6
print("ค่า a มากกว่า หรือ เท่ากับ b หรือไม่ : " ,a>=b) #เคสใดเป็นจริง ถือว่า True
v,c = 8,7
print("ค่า v น้อยกว่า หรือ เท่ากับ c หรือไม่ : " ,v>=c)

#และ
q,w,e = 8,7,9
print("ค่า q มากกว่า w และ w มากกว่า e หรือไม่ : " ,q>w>e) #ทุกเคสต้องเป็น จริง/เท็จ เหมือนกัน
i,o,p = 8,7,5
print("ค่า i มากกว่า o และ o มากกว่า p หรือไม่ : " ,i>o>p) 