# แบบปกติ
fruit={"มะม่วง"," มะขาม","มะยม"}
print(fruit)
# การระบุ index ไม่สามารถใช้ได้กับ Set เพราะมีลำกับที่ไม่แน่นอน

# แบบ Constrctor(การระบุชื่อชนิดข้อมูล)
fish=set(["ปลาดุก","ปลาหมอ","ปลาดุก"]) # set จะไม่เก็บข้อมูลซื้อ
print(fish)

# การเพิ่มสมาชิก
# เพิ่มข้อมูลทีละตัว
fruit={"มะม่วง"," มะขาม","มะยม"}
fruit.add("ทุเรียน")
fruit.add("888")
print(fruit)
# เพิ่มข้อมูลหลายๆตัว
lis=["ตะไคร้","โหระพา","ชะอม"]
fruit.update(lis)
print(fruit)

# Loop
for item in fruit:
    print("ขัอมูล",item)

# แสดงจำนวนสมาชิกใน set
print(len(fruit))

# ลบสมาชิก
fruit.remove("ทุเรียน") # การลบสมาชิกเมื่อเจอสมาชิก และ เกิด error เมื่อไม่เจอสมาชิกที่จะลบ
fruit.discard("มะปราง") # การลบสมาชิกเมื่อเจอสมาชิก และ ไม่เกิด error เมื่อไม่เจอสมาชิกที่จะลบ
print(fruit)

# การลบสมาชิก
fruit.clear # ลบสมาชิก
del fruit # ลบตัวแปร
