# Assignment4

#การแลกเงินโอนเพื่อหาประเภทของแบงค์
#การเขียนโปรแกรมแลกเงิน

#ผลลัพธ์ที่ต้องการ
# จำนวนเงิน 2000 บาท => 1000 = 2 ใบ
# จำนวนเงิน 1500 บาท => 1000 = 1 ใบ , 500 = 1 ใบ
# จำนวนเงิน 1800 บาท => 1000 = 1 ใบ , 500 = 1 ใบ , 100 = 3 ใบ
# จำนวนเงิน 100 บาท  => 50 = 2 ใบ

number = int(input("ป้อนจำนวนเงินของคุณ : "))

#ต้องการทราบประเภทแบงค์ว่าได้อะไรบ้าง ตามจำนวนเงินที่ใส่เข้าไป

#การใส่ if คือการเช็คทุกเคส
if number>=1000:
    print("1000 บาท = ",number//1000,"ใบ") # 1 ใบ
    number = number % 1000 # หากเราป้อนตัวเลขเท่ากับ 1500 บาท => 1500 % 1000 = 500 แล้วเอา 500 ไปเก็บในตัวแปร number บรรทัดที่ 20

if number>=500: #จากนั้นก็คิดต่อไปเรื่อยๆ
    print("500 บาท = ",number//500,"ใบ")
    number%=500 #ลดรูปโค้ด

if number>=100:
    print("100 บาท = ",number//100,"ใบ")
    number%=100

if number>=50:
    print("50 บาท = ",number//50,"ใบ")
    number%=50

if number>=20:
    print("20 บาท = ",number//20,"ใบ")
    number%=20

    #เป็นโค้ดที่ไล่ลำดับลงไปเรื่อยๆ จนกว่าตัวหารจะเป็น 0
