# Assignment 11 # ค้นหาตัวเลข มากสุด / น้อยสุด , การเปรียบเทียบตัวเลข

max ,min = 0,9999

while True :
    number=int(input("ป้อนตัวเลขของคุณ :")) 
    #หากกระโดดออกจาก loop 
    if number<0 : # หากป้อนตัวเลขที่น้อยกว่า 0 โปรแกรมจะจบการทำงาน
        break
    if number>max : # หากค่าที่ป้อนมีค่ามากกว่าค่า max เดิม โปรแกรมจะเอาค่าที่มากที่สุดไปใส่ในค่า max เช่น ตอนนี้เรากำหนดค่า max=0 หากเราป้อนตัวเลข 10 max ก็จะเท่ากับ 10
        max=number
    if number<min: # หากค่าที่ป้อนมีค่าน้อยกว่าค่า min เดิม โปรแกรมจะเอาค่าที่น้อยที่สุดไปใส่ในค่า min เช่น ตอนนี้เรากำหนดค่า min=9999 หากเราป้อนตัวเลข 1 min ก็จะเท่ากับ 1
        min=number

print("ค่าสูงสุด = ", max)
print("ค่าต่ำสุด = ",min)