# AND = และ
# OR = หรือ
# NOT = ไม่
# คำตอบที่ได้ => จริง / เท็จ

# Basic
x = (5>10) #ค่า bool
y = (10==5) #ค่า bool
print(x)
print(y)

#AND
A = (10>5)
B = (10==5)
C = A and B
print(C)
# C = (10>5) and (10==5) เป็นจริง 1 และ เป็นเท็จ 1
Q = (10>5)
W = (10!=5)
E = Q and W
print(E)
# C = (10>5) and (10!=5) เป็นจริงทั้งสอง

# OR
T = (4>5)
Y = (10!=5)
U = T and Y
print(U)
# C = (4>5) and (10!=5) เพียงแค่ฝั่งใดฝั่งหนึ่งเป็นจริง/เท็จ

#NOT
I = (4>5)
O = (10!=5)
P = T and Y
print(not P)
# C = (4>5) and (10!=5) อยากให้คำตอบตรงข้ามให้ใส่ NOT ข้างหน้า

