x=10
print("ก่อนเพิ่มค่า" ,x)

x=10+5
print("หลังเพิ่มค่า" ,x)
x+=5 #เหมือนบรรทัดที่สอง
print("หลังเพิ่มค่า" ,x)

x=x-10
print("หลังลบค่า" ,x)
x-=5
print("หลังลบค่า" ,x)

x=x*5
print("หลังคูณค่า" ,x)
x*=5
print("หลังคูณค่า" ,x)

x=x/5
print("หลังหารค่า" ,x)
x/=4
print("หลังหารค่า" ,x)

x=x//4 
print("หลังหารปัดเศษค่า" ,x)
x//=4
print("หลังหารปัดเศษค่า" ,x)

x=x**2
print("หลังยกกำลังค่า" ,x)
x**=7
print("หลังยกกำลังค่า" ,x)

x=x%2
print("หลังหารเอาเศษค่า" ,x)
x%=2
print("หลังหารเอาเศษค่า" ,x)


