'''
โครงสร้างควบคุม (Control Structure)
1.แบบลำดับ
2.แบบเลือก => EP.นี้ใช้อันนี้
3.แบบทำซ้ำ
'''

'''
if expression
    statement #การ tap เพื่อกำหนดเงื่อนไขภายใน if
'''

อายุ=int(input("ป้อนอายุของคุุณ :"))
print(type(อายุ==15)) # เครื่องหมาย <,>,== เป็น boolean อยู่แล้ว

ชื่อ="dotcom29"
print(ชื่อ=="dotcom29")

#เงื่อนไขเดียว
age1=int(input("ป้อนอายุของคุณ :"))
if age1>=15:
    print("คำนำหน้าเป็นของคุณเป็น นาย/นางสาว เพราะอายุเกิน 15")
    print("จบโปรแกรมด้านใน if")
print("จบโปรแกรม")
#สรุป if => if คือการกำหนดเงื่อนไขว่าหากเป็นจริงจะให้แสดงผลอย่างไร

'''
if :
    ทำอะไร
else :
    ทำอะไร
if ต้องมาก่อน else เสมอ เพื่อจับคู่กัน
'''

#สองเงื่อนไข
age2=int(input("ป้อนอายุของคุณ :"))
if age2>=15:
    print("คำนำหน้าเป็นของคุณเป็น นาย/นางสาว เพราะอายุเกิน 15")
    print("จบโปรแกรมด้านใน if")
else :
    print("คำนำหน้าเป็น เด็กชาย/เด็กหญิง เพราะอายุไม่เกิน 15")
print("จบโปรแกรม")

#หลายเงื่อนไข
age3=int(input("ป้อนอายุของคุณ :"))
if age3>=15 :
    print("วัยรุ่น")
if age3>=20 :
    print("วัยผู้ใหญ่")
if age3>=30 :